<details><summary>Show Terraform Apply:</summary>

```
module.fsx.data.aws_partition.current: Reading...
module.fsx.data.aws_ami.windows_2022_base_image: Reading...
module.fsx.data.aws_caller_identity.current: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.networking.data.aws_availability_zones.available: Reading...
module.fsx.data.aws_partition.current: Read complete after 0s [id=aws]
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.fsx.data.aws_caller_identity.current: Read complete after 0s [id=270129723225]
module.fsx.data.aws_iam_policy_document.fsx_key: Reading...
module.fsx.data.aws_iam_policy_document.fsx_key: Read complete after 0s [id=3191587997]
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=ca-central-1]
module.fsx.data.aws_ami.windows_2022_base_image: Read complete after 0s [id=ami-00ca115a09ca61d7a]
module.networking.data.aws_security_group.default: Reading...
module.fsx.data.aws_vpc.selected: Reading...
module.networking.data.aws_iam_policy_document.generic_endpoint_policy: Reading...
module.networking.data.aws_iam_policy_document.generic_endpoint_policy: Read complete after 0s [id=2991258920]
module.networking.data.aws_iam_policy_document.dynamodb_endpoint_policy: Reading...
module.networking.data.aws_iam_policy_document.dynamodb_endpoint_policy: Read complete after 0s [id=1657688723]
module.networking.data.aws_security_group.default: Read complete after 0s [id=sg-066bc58d83cd70a4a]
module.fsx.data.aws_vpc.selected: Read complete after 0s [id=vpc-03822a35410099946]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["dynamodb"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["secret_manager"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["kms"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=2766233735]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=1215220413]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=2773141372]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["dynamodb"]: Read complete after 0s [id=2504937670]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=1759994176]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["secret_manager"]: Read complete after 0s [id=2052583196]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=3788720971]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["kms"]: Read complete after 0s [id=1947548361]
module.fsx.data.aws_iam_policy_document.ad_logs: Reading...
module.fsx.data.aws_iam_policy_document.ad_logs: Read complete after 0s [id=4181754098]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fsx.aws_fsx_windows_file_system.this has changed
  ~ resource "aws_fsx_windows_file_system" "this" {
      + aliases                           = []
        id                                = "fs-02a61dc13838f4a8e"
        tags                              = {
            "ApplicationName" = "poc-infinitt"
            "GithubOrg"       = "InfinittNA"
            "GithubRepo"      = "infinittna-aws-ollion"
            "Name"            = "infinitt-file-system"
        }
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.fsx.aws_fsx_windows_file_system.this will be updated in-place
  ~ resource "aws_fsx_windows_file_system" "this" {
        id                                = "fs-02a61dc13838f4a8e"
        tags                              = {
            "ApplicationName" = "poc-infinitt"
            "GithubOrg"       = "InfinittNA"
            "GithubRepo"      = "infinittna-aws-ollion"
            "Name"            = "infinitt-file-system"
        }
      ~ throughput_capacity               = 8 -> 32
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fsx.aws_instance.ad_manager will be created
  + resource "aws_instance" "ad_manager" {
      + ami                                  = "ami-00ca115a09ca61d7a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "poc-infinitt-dev-ad-manager"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "Infinitt-CA-Central-Test-Key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0bf77e9aa8bad72af"
      + tags                                 = {
          + "ApplicationName" = "poc-infinitt"
          + "GithubOrg"       = "InfinittNA"
          + "GithubRepo"      = "infinittna-aws-ollion"
          + "Name"            = "poc-infinitt-dev-fsx-ad-manager"
        }
      + tags_all                             = {
          + "ApplicationName" = "poc-infinitt"
          + "GithubOrg"       = "InfinittNA"
          + "GithubRepo"      = "infinittna-aws-ollion"
          + "Name"            = "poc-infinitt-dev-fsx-ad-manager"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ceb6e6474a86db00addf952f11f3bf5bdb1dc82d"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0439691bbf4a6288f",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy. 
```
</details>

 Merged by @INA-pboleski. Workflow: `Infinitt Networking OIDC Workflow` 